start_text = "////////////////////////////////////////////////////////////////////////////////////\n" \
             "//                    Добро пожаловать в игру 2048 by Wallseat!                   //\n" \
             "// Для загрузки сохранения напишите /load, для начала новой игры напишите /newgame//\n" \
             "//        Для просмотра правил игры напишите /help, для выхода напишите /exit     //\n" \
             "////////////////////////////////////////////////////////////////////////////////////\n"

help_text = "/////////////////////////////////////////////////////////////////////////////////////\n" \
            "//                 Цель проста - собрать клетку с нужным числом.                   //\n" \
            "//           Для перемещения клеток по полю, воспользуйтесь командами:             //\n" \
            "//                  w - вверх, s - вниз, a - влево, d - вправо.                    //\n" \
            "/////////////////////////////////////////////////////////////////////////////////////\n"

field_select_text = "Введите команду для старта игры на поле:\n" \
                    "          4 - 4x4, цель - 2048          \n" \
                    "          5 - 5x5, цель - 16384         \n" \
                    "          6 - 6x6, цель - 131072        \n" \
                    "          8 - 8x8, цель - 1048576       \n" \
                    "      /back - чтобы вернуться назад     \n"

w_command_err = "Нет такой команды, повторите ввод!\n"

win_text = "///////////////////////////////\n" \
           "// Вы победели! Поздравляем! //\n" \
           "///////////////////////////////\n"

lose_text = "///////////////////////////////////////////\n" \
            "// Увы, вы проиграли. Попробуйте еще раз!//\n" \
            "///////////////////////////////////////////\n"

start_help_text = "Чтобы увидеть список команд напишите /esc\n"

esc_text = "          Список команд:\n" \
           "/help - чтобы узнать помощь в игре\n" \
           "/savegame - чтобы сохранить игру\n" \
           "/exit - чтобы выйти в меню\n" \
           "/esc или /back - чтобы вернуться к игре\n"
